app/views/articles/index.html.haml

      %td{:style => "padding:20px"}= article.content
      %td{:style => "padding:20px"}= raw article.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ')
---
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN articles ON articles.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Article' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT articles.id FROM `articles` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id