app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` JOIN taggings articles_taggings_d0a9060 ON articles_taggings_d0a9060.taggable_id = articles.id AND articles_taggings_d0a9060.taggable_type = 'Article' AND articles_taggings_d0a9060.tag_id = 6
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN articles ON articles.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Article' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT articles.id FROM `articles` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index
    if params[:tag]
      @articles = Article.tagged_with(params[:tag])
    else
      @articles = Article.all

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def show
    @article = Article.find(params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def edit
    @article = Article.find(params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `updated_at` = '2013-02-28 16:00:53' WHERE `articles`.`id` = 1
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])